Revit 2027 API
ParameterTypeId.MaterialParamShininess Property
 "Shininess"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialParamShininess { get; }
Public Shared ReadOnly Property MaterialParamShininess As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialParamShininess {
	ForgeTypeId^ get ();
}
static member MaterialParamShininess : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace